<?php

return [ 
    'user_register_welcome_mail_master' => [
        'subject' => 'مرحبًا بك في منصتنا',
        'body' => [
            'line1' => 'عزيزي :user_name,',
            'line2' => "مرحبًا بكم في منصة وابل و يسعدنا انضمامك. يمكنك الآن تسجيل الدخول والبدء في استكشاف المعلم المنشود القريب منك لتحقيق أهدافك. شكرًا لانضمامك إلينا!",
            'line3' => 'مع أطيب التحيات، فريق منصة وابل',
        ]
    ],

    'user_register_welcome_mail_student' => [
        'subject' => 'مرحبًا بك في منصتنا',
        'body' => [
            'line1' => 'عزيزي :user_name,',
            'line2' => "مرحبًا بكم في منصة وابل و يسعدنا انضمامك. يمكنك الآن تسجيل الدخول وعرض خبرتك ومهاراتك بأفضل صورة عبر المنصة لتمكين تواصل الطلاب معك مباشرة لتحقيق أهدافك. شكرًا لانضمامك إلينا!",
            'line3' => 'مع أطيب التحيات، فريق منصة وابل',
        ]
    ],

    'user_register_mail_super_admin' => [
        'subject' => 'قام مستخدم جديد بالتسجيل',
        'body' => [
            'line1' => 'عزيزي,',
            'line2' => "قام مستخدم جديد بالتسجيل على المنصة:",
            'line3' => 'الاسم: <strong>:username</strong>',
            'line4' => 'البريد الإلكتروني: <strong>:userEmail</strong>',
            'line5' => 'الدور: <strong>:role</strong>',
            'line6' => 'رقم الجوال: <strong>0:phone_number</strong>',
            'line7' => 'يرجى مراجعة ملفه الشخصي إذا لزم الأمر',
        ]
    ],

    'speciality_request_mail_super_admin' => [
        'subject' => 'بريد طلب التخصص',
        'body' => [
            'line1' => 'عزيزي,',
            'line2' => "لقد استلمت هذا البريد الإلكتروني لأن مستخدم منصة وابل أرسل طلب تخصص.",
            'line3' => 'يرجى النقر على الرابط أدناه لاتخاذ الإجراء:',
            'button'=> 'طلب التخصص',
            'line4' => 'إذا واجهت مشكلة في ضغط زر "طلب التخصص"، انسخ الرابط أدناه والصقه في متصفحك :specialty_request_url',
        ]
    ],

    'speciality_added_by_master_mail_student' => [
        'subject' => 'تمت إضافة تخصص بواسطة ماستر',
        'body' => [
            'line1' => 'عزيزي :user_name,',
            'line2' => "مبروك! طلبك للتخصص  <strong>:specialty_name</strong>  تمت اضافته في منصة وابل! نحن نسمع صوتك ونلتزم  بدعمكم ",
        ]
    ],

    'forgot_password_otp_mail_user' => [
        'subject' => 'رمز التحقق لإعادة تعيين كلمة المرور',
        'body' => [
            'line1' => 'عزيزي :user_name,',
            'line2' => "لقد تلقينا طلبًا لإعادة تعيين كلمة المرور الخاصة بك. يرجى استخدام رمز التحقق التالي للمتابعة:",
            'line3' => 'رمز التحقق الخاص بك :token',
            'line4' => 'سينتهي صلاحية هذا الرمز خلال :expiretime. إذا لم تطلب إعادة تعيين كلمة المرور، يرجى تجاهل هذا البريد الإلكتروني.',
        ]
    ],

    'reset_password_mail_user' => [
        'subject' => 'إشعار إعادة تعيين كلمة المرور',
        'body' => [
            'line1' => 'عزيزي :user_name,',
            'line2' => "<strong>حسابك:</strong>",
            'line3' => 'لقد استلمت هذا البريد الإلكتروني لأننا تلقينا طلبًا لإعادة تعيين كلمة المرور لحسابك.يرجى النقر على الرابط أدناه لإعادة تعيين كلمة المرور والوصول إلى حسابك:',
            'button'=> 'إعادة تعيين كلمة المرور',
            'line4' => 'إذا واجهت مشكلة في ضغط  زر "إعادة تعيين كلمة المرور"، انسخ الرابط أدناه والصقه في متصفحك: :reset_password_url',
        ]
    ],
    
    'subscription_activation_mail_master' => [
        'subject' => ' تم تفعيل اشتراكك',
        'body' => [
            'line1' => 'مرحبًا :user_name,',
            'line2' => "شكرًا لاشتراكك في باقة <strong>:plan_name.</strong>",
            'line3' => 'دورة الفوترة: <strong>:billing_cycle</strong>',
            'line4' => 'تاريخ البدء: <strong>:start_date</strong>',
            'line5' => 'تاريخ الانتهاء: <strong>:end_date</strong>',
            'line6' => 'المبلغ المدفوع: <strong>:price</strong>',
            'line7' => 'تم تفعيل اشتراكك الآن. استمتع بجميع المميزات المتضمنة في باقتك!',
        ]
    ],

    'subscription_activation_mail_super_admin' => [
        'subject' => 'تم شراء اشتراك جديد',
        'body' => [
            'line1' => 'عزيزي,',
            'line2' => "تم شراء اشتراك جديد بواسطة:",
            'line3' => 'الاسم: <strong>:user_name</strong>',
            'line4' => 'البريد الإلكتروني: <strong>:user_email</strong>',
            'line5' => 'رقم الجوال: <strong>0:phone_number</strong>',
            'line6' => 'الخطة: <strong>:plan_name</strong>',
            'line7' => 'دورة الفوترة: <strong>:billing_cycle</strong>',
            'line8' => 'المبلغ المدفوع: <strong>:price</strong>',
            'line9' => 'تاريخ البدء: <strong>:start_date</strong>',
            'line10' => 'تاريخ الانتهاء: <strong>:end_date</strong>',
        ]
    ],

    'subscription_plan_deactivated_master' => [
        'subject' => 'تم إلغاء تفعيل خطة اشتراكك',
        'body' => [
            'line1' => 'مرحبًا :user_name',
            'line2' => "نود إبلاغك بأن خطة اشتراكك الحالية <strong>:plan_name</strong> قد تم إلغاء تفعيلها من قبل المسؤول.",
            'line3' => 'يمكنك الاستمرار في استخدام الخطة حتى <strong>:end_date</strong>، ولكن لن يتم تجديدها تلقائيًا. يرجى اختيار خطة جديدة للاستمرار دون انقطاع.',
        ]
    ],

    'subscription_plan_activated_master' => [
        'subject' => 'خبر سار! تم تفعيل خطة اشتراكك مرة أخرى',
        'body' => [
            'line1' => 'مرحبًا :user_name',
            'line2' => "نحن متحمسون لإبلاغك بأن خطة اشتراكك <strong>:plan_name</strong> قد أعيد تفعيلها من قبل المسؤول.",
            'line3' => 'إذا انتهت صلاحية اشتراكك في وقت سابق، يمكنك شراء هذه الخطة مرة أخرى من لوحة التحكم الخاصة بك.',
        ]
    ],

    'speciality_update_mail_user' => [
        'subject' => 'تم قبول طلب التخصص',
        'body' => [
            'line1' => 'عزيزي :name',
            'line2' => "لقد استلمت هذا البريد الإلكتروني لأن Wabell قد قبلت طلب التخصص <b>:specialty_name</b>.",
        ]
    ],

    'user_ban_status_mail' => [
        'subject' => 'تم حظر حسابك',
        'body' => [
            'line1' => 'مرحباً :name',
            'line2' => 'نأسف لإبلاغك بأنه تم حظر حسابك من قبل المسؤول. إذا كنت تعتقد أن هذا خطأ أو كنت بحاجة إلى مزيد من المساعدة، يرجى التواصل مع فريق الدعم لدينا على :supportEmail.',
            'line3' => 'شكراً لتفهمك',
        ]
    ],

    'user_selected_other_location_mail' => [
        'subject' => 'اختار المستخدم مدينة أو حي آخر',
        'body' => [
            'line1' => 'مرحباً',
            'line2' => 'قام مستخدم جديد بالتسجيل واختار <strong>"أخرى"</strong> للمدينة أو الحي.',
            'line3' => 'الاسم: :name',
            'line4' => 'البريد الإلكتروني: :email',
            'line5' => 'رقم الهاتف: 0:phone',
            'line6' => 'المدينة: :city',
            'line7' => 'الحي: :neighborhood',
            'line8' => 'الدور: :role',
        ]
    ],

    'master_subscription_expired_renew_mail' => [
        'subject' => 'إجراء مطلوب: يرجى تحديث وسيلة الدفع للاحتفاظ باشتراكك نشطاً',
        'body' => [
            'line1' => 'مرحباً :name',
            'line2' => 'تعذر علينا تجديد اشتراكك بسبب مشكلة في الدفع مرتبطة بحسابك في App Store.',
            'line3' => 'خبر جيد: اشتراكك لا يزال نشطاً في الوقت الحالي، ويمكنك الاستمرار في الاستمتاع بجميع الميزات المميزة دون انقطاع.',
            'line4' => 'لتجنب فقدان إمكانية الوصول في المستقبل، يرجى تحديث وسيلة الدفع الخاصة بك في إعدادات Apple ID.',
            'line5' => 'ستقوم شركة Apple بمحاولة تحصيل الدفعة تلقائياً بمجرد تحديث تفاصيل الدفع الخاصة بك.',
            'line6' => 'تم رفض عملية الدفع من قبل البنك الذي تتعامل معه.',
            'line7' => 'إذا لم يتم إكمال عملية الدفع قبل نهاية فترة السماح، فقد تنتهي صلاحية اشتراكك.',
            'line8' => 'إذا كنت بحاجة إلى أي مساعدة، فلا تتردد في الاتصال بفريق الدعم لدينا.'
        ]
    ],

    'master_subscription_expired_mail' => [
        'subject' => 'لقد تم إلغاء اشتراكك',
        'body' => [
            'line1' => 'مرحباً :name',
            'line2' => 'لقد انتهت صلاحية اشتراكك في Wabell لانتهاء فترة الفوترة الحالية.',
            'line3' => 'لم يعد لديك صلاحية الوصول إلى الميزات المميزة المرتبطة باشتراكك.',
            'line4' => 'يمكنك تجديد اشتراكك في أي وقت عن طريق فتح التطبيق واختيار الخطة التي تناسبك بشكل أفضل.',
            'line5' => 'يسعدنا جداً عودتك إلينا مجدداً!',
        ]
    ],

    'master_subscription_cancelled_mail' => [
        'subject' => 'لقد تم إلغاء اشتراكك',
        'body' => [
            'line1' => 'مرحباً :name',
            'line2' => 'لقد انتهت صلاحية اشتراكك في Wabell لأنه قد تم إلغاؤه ووصل الآن إلى نهاية فترة صلاحيته النشطة.',
            'line3' => 'لن تتمكن بعد الآن من الوصول إلى الميزات المميزة، ولكن يمكنك إعادة الاشتراك في أي وقت من خلال التطبيق.',
            'line4' => 'شكراً لكونك جزءاً من Wabell. نأمل أن نراك مرة أخرى قريباً.',
        ]
    ],

    'regards'   => 'مع التحية،',
    'team'      => 'Wabell',
    'copyright' => '© :year جميع الحقوق محفوظة لشركة Wabell',
    'wabell' => 'وابل',
    'footer_data' => 'منصة Wabell، للناس، من قبل الناس',
    'privacy_policy' => 'سياسة الخصوصية',
    'terms_of_service' => 'شروط الخدمة'
];


?>